In [2]:
import pandas as pd

#### Creating Series

In [3]:
age = pd.Series([32,23,25,18,27,40])
type(age)

pandas.core.series.Series

In [4]:
print(age)

0    32
1    23
2    25
3    18
4    27
5    40
dtype: int64

In [5]:
age.ndim,age.shape,age.dtype

(1, (6,), dtype('int64'))

In [6]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [7]:
cars =pd.read_csv("E:/Dataset/Data/usedcars.csv")
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       150 non-null    int64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: int64(3), object(3)
memory usage: 7.2+ KB

#### Displaying the data of only a single column

In [8]:
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [9]:
cars['price']

0      21992
1      20995
2      19995
3      17809
4      17500
       ...
145     6200
146     5995
147     5980
148     4899
149     3800
Name: price, Length: 150, dtype: int64

In [10]:
type(cars['price'])

pandas.core.series.Series

#### Selecting more than 1 Column, here the datatype List is used

In [11]:
cars[['price','mileage']]

     price  mileage
0    21992     7413
1    20995    10926
2    19995     7351
3    17809    11613
4    17500     8367
..     ...      ...
145   6200    95000
146   5995    87003
147   5980    96841
148   4899   151479
149   3800   109259

[150 rows x 2 columns]

In [13]:
cars[['price']]

     price
0    21992
1    20995
2    19995
3    17809
4    17500
..     ...
145   6200
146   5995
147   5980
148   4899
149   3800

[150 rows x 1 columns]

In [14]:
type(cars[['price']])

pandas.core.frame.DataFrame